Revit 2027 API
BuiltInFailures.StairRampFailures.RiserThicknesssResetToZero Property
 Monolithic Stairs without Treads can't have Risers. Riser Thickness for Stairs Type was automatically set to zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RiserThicknesssResetToZero { get; }
Public Shared ReadOnly Property RiserThicknesssResetToZero As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RiserThicknesssResetToZero {
	FailureDefinitionId^ get ();
}
static member RiserThicknesssResetToZero : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace